# get brew cask for apps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'sanemat/font'
tap 'kyoshidajp/ghkw'

# install the apps
cask 'java' unless system "/usr/libexec/java_home --failfast"
cask 'firefox'
cask 'iterm2'
cask 'sublime-text'
cask 'adoptopenjdk8'
cask 'google-japanese-ime'
cask 'dropbox'
cask 'google-chrome'
cask 'slack'
cask 'alfred'
cask 'phantomjs'

# install scripts
brew 'wget'
brew 'rbenv'
brew 'ruby-build'
brew 'mysql'
brew 'ricty'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zplug'
brew 'git'
brew 'hub'
brew 'embulk'
brew 'digdag'
brew 'direnv'
brew 'ffmpeg'
brew 'ghkw'
